{
  "ID": "julien",
  "Name":"Julien Garsia",
  "Job": "Software Engineer | Blogger",
  "Banner": "assets/banner.jpg",
  "Description": ["Hello World ! I'm a french developer that like to create stuff and share them with some people. This place will host those things that I want to create!",
    ""],
  "SecondaryCard": {
    "Title": "Currently",
    "Content": ["###### **Working** \n* ❗Looking for a permanent position as a **Software Engineer** starting at the end of the year, located in Paris or remotely in Italy.\n ###### **Reading** \n* *It* by Stephen King \n* *Des siècles d'immortalité* by Hélène Carrère d'Encausse \n###### **Writing**  Posts about\n* Learning process (FR) \n* Institut de France (FR) \n* PassMan, my own Password Manager (EN)"]
  },
  "TabCategory": ["Work", "Projects", "Photo"],
  "WorkData": [{
    "Title": "2024) ECOFI",
    "Badge": {"Color": "#435d75", "Text": "Software architect"},
    "Text": "Actually working on the whole structure of the Information System in a small team at ECOFI a money management firm, daughter company of Crédit Coopératif member of the BCPE group. This mission implies developing **Python** script to parse files DTSX Files, usage of **SQL Server and a global vision on clean architecture**"
      },{
      "Title": "2023) MetaFootballLeague",
      "Badge": {"Color": "#435d75", "Text": "Fullstack Developer"},
      "Text": "This was my first experience in the fullstack environnement, I used **Next.js, TypeScript and MongoDB** to investigate if the AI could generate players for the game. I developed a website that could generate players, adjusted the settings of the generation, save them in **S3**, and moderate them."
    },{
    "Title": "2021) Concentus",
    "Badge": {"Color": "#435d75", "Text": "Lead Developer"},
    "Text": "I joined this startup working on a charge point for electric vehicles in collaboration with Total Energie, I had to propose solutions to problematic regarding the communication between two projects developed in different technology **C++** and **Python**. I recommended the usage of **Protocol Buffer**, and we started working on this solution with the 3 other people together."
    },{
    "Title": "2020) OXIO",
    "Badge": {"Color": "#435d75", "Text": "Software Engineer"},
    "Text": "I spent 6 more months at OXIO, working independently on an issue and its monitoring. To achieve this goal, I developed a **Python** script to query specific databases of the project, and processed and compared the results value on a **Google Spread Sheet using API**"
  },{
    "Title": "2019) OXIO",
    "Badge": {"Color": "#435d75", "Text": "Software Engineer"},
    "Text": "My first experience in an American startup doing business in telecommunication. I joined the engineering team to work on the main product. I discovered how to work efficiently as a team, and technical points like **Go, Protocol Buffers, MongoDB** and how to build a project designed in **microservices**. "
  }
  ],
  "ProjectsData": [{
    "Title": "PassMan",
    "Text": "I used my skills in Go to design myself a cross platform password manager, using the same process every company does to store passwords. I used Wails, that allowed me to develop the backend in Go & and frontend with TypeScript and React. I did everything in this project : the client, designer and the developer!",
    "Image": "/postImg/PassMan/Passman.png",
    "Redirect": "/projects/PassMan"
  },{
    "Title": "SafeCall",
    "Text": "2.5 years of development with 7 people to create a social network without any leak of data. I designed most of the application, from the backend organized in microservices to the deployment. I successfully designed a working application, and we developed it.",
    "Image": "/postImg/SafeCall/test.png",
    "Redirect": "/projects/SafeCall"
  }],
  "ContactData": {
    "Text": "Thanks for having interest in my profile! I'll be very pleased if we get in touch, I'm always open to meet new people and to seek new opportunities !",
    "Email": "julien.garsia@proton.me",
    "LinkedIn": "https://www.linkedin.com/in/julien-garsia/",
    "CV": "/cv/JulienGARSIA.pdf"
  }
}